tsung_logs/20241214-0534/overall.xml
<?xml version="1.0"?><tsung loglevel="debug">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="114514"/>
    </clients>
    <servers>
        <server host="localhost" port="3000" type="tcp"/>
    </servers>
    <load>
        <arrivalphase phase="1" duration="60" unit="second">
            <users arrivalrate="1" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="2" duration="60" unit="second">
            <users arrivalrate="2" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="3" duration="60" unit="second">
            <users arrivalrate="4" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="4" duration="60" unit="second">
            <users arrivalrate="8" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="5" duration="60" unit="second">
            <users arrivalrate="16" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="6" duration="60" unit="second">
            <users arrivalrate="32" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="7" duration="60" unit="second">
            <users arrivalrate="64" unit="second"/>
        </arrivalphase>
    </load>
    <sessions>
                <session name="create_and_view_event" probability="20" type="ts_http">
            <request subst="true">
                <dyn_variable name="token" re="\&quot;token\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <dyn_variable name="user_id" re="\&quot;id\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <http url="/api/register" method="POST" version="1.1" contents_from_file="./tsung_scripts/json/register.json">
                    <http_header name="Content-Type" value="application/json"/>
                </http>
            </request>
            <thinktime value="2"/>
            <request subst="true">
                <http url="/api/events?page=1" method="GET" version="1.1">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
            <thinktime value="2"/>
            <request subst="true">
                <dyn_variable name="event_id" re="\&quot;id\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <http url="/api/events" method="POST" version="1.1" contents_from_file="./tsung_scripts/json/create_event.json">
                    <http_header name="Content-Type" value="application/json"/>
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>            
            </request>
            <request subst="true">
                <http url="/api/events/%%_event_id%%" method="GET" version="1.1">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
        </session>

        <session name="view_and_comment_event" probability="20" type="ts_http">
           <request subst="true">
                <dyn_variable name="token" re="\&quot;token\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <dyn_variable name="user_id" re="\&quot;id\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <http url="/api/register" method="POST" version="1.1" contents_from_file="./tsung_scripts/json/register.json">
                    <http_header name="Content-Type" value="application/json"/>
                </http>
            </request>
            <thinktime value="2"/>
            <request subst="true">
                <http url="/api/events?page=1" method="GET" version="1.1">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
            <thinktime value="2"/>
            <setdynvars sourcetype="random_number" start="1" end="20"><var name="event_id"/></setdynvars>
            <request subst="true">
                <dyn_variable name="event_id" re="\&quot;id\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <http url="/api/events/%%_event_id%%" method="GET" version="1.1">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>            
            </request>
            <thinktime value="2"/>
            <request subst="true">
                <dyn_variable name="comment_id" re="\&quot;id\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <http url="/api/events/%%_event_id%%/comments" method="POST" version="1.1" contents_from_file="./tsung_scripts/json/create_comment.json">
                    <http_header name="Content-Type" value="application/json"/>
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
            <request subst="true">
                <http url="/api/events/%%_event_id%%/comments/%%_comment_id%%" method="PUT" version="1.1" contents_from_file="./tsung_scripts/json/update_comment.json">
                    <http_header name="Content-Type" value="application/json"/>
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
        </session>

        <session name="register_view_rsvp" probability="20" type="ts_http">
            <request subst="true">
                <dyn_variable name="token" re="\&quot;token\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <dyn_variable name="user_id" re="\&quot;id\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <http url="/api/register" method="POST" version="1.1" contents_from_file="./tsung_scripts/json/register.json">
                    <http_header name="Content-Type" value="application/json"/>
                </http>
            </request>
            <thinktime value="2"/>
            <request subst="true">
                <http url="/api/events?page=1" method="GET" version="1.1">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
            <thinktime value="2"/>
            <setdynvars sourcetype="random_number" start="1" end="20"><var name="event_id"/></setdynvars>
            <request subst="true">
                <http url="/api/events/%%_event_id%%" method="GET" version="1.1">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
            <thinktime value="2"/>
            <request subst="true">
                <dyn_variable name="rsvp_id" re="\&quot;id\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <http url="/api/events/%%_event_id%%/rsvp" method="POST" version="1.1" contents_from_file="./tsung_scripts/json/create_rsvp.json">
                    <http_header name="Content-Type" value="application/json"/>
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
            <thinktime value="2"/>
            <request subst="true">
                <http url="/api/events/%%_event_id%%/rsvps?start_time=2024-12-01T00:00:00Z&amp;end_time=2024-12-31T23:59:59Z" method="GET" version="1.1">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
        </session>

        <session name="register_view_invite" probability="20" type="ts_http">
            <request subst="true">
                <dyn_variable name="token" re="\&quot;token\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <dyn_variable name="user_id" re="\&quot;id\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <http url="/api/register" method="POST" version="1.1" contents_from_file="./tsung_scripts/json/register.json">
                    <http_header name="Content-Type" value="application/json"/>
                </http>
            </request>
            <thinktime value="2"/>
            <request subst="true">
                <http url="/api/events?page=1" method="GET" version="1.1">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
            <thinktime value="2"/>
            <setdynvars sourcetype="random_number" start="1" end="20"><var name="event_id"/></setdynvars>
            <request subst="true">
                <http url="/api/events/%%_event_id%%" method="GET" version="1.1">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
            <thinktime value="2"/>
            <setdynvars sourcetype="random_number" start="1" end="20"><var name="invited_user_id"/></setdynvars>
            <request subst="true">
                <dyn_variable name="invite_id" re="\&quot;id\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <http url="/api/events/%%_event_id%%/invite" method="POST" version="1.1" contents_from_file="./tsung_scripts/json/invite_user.json">
                    <http_header name="Content-Type" value="application/json"/>
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
            <thinktime value="2"/>
            <request subst="true">
                <http url="/api/invites/sent" method="GET" version="1.1">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
        </session>

        <session name="register_follow_check" probability="20" type="ts_http">
            <request subst="true">
                <dyn_variable name="token" re="\&quot;token\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <dyn_variable name="user_id" re="\&quot;id\&quot;: \&quot;([^\&quot;]+)\&quot;"/>
                <http url="/api/register" method="POST" version="1.1" contents_from_file="./tsung_scripts/json/register.json">
                    <http_header name="Content-Type" value="application/json"/>
                </http>
            </request>
            <thinktime value="2"/>
            <setdynvars sourcetype="random_number" start="1" end="20"><var name="followed_user_id"/></setdynvars>
            <request subst="true">
                <http url="/api/follows" method="POST" version="1.1" contents_from_file="./tsung_scripts/json/follow_user.json">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
            <thinktime value="2"/>
            <request subst="true">
                <http url="/api/users/followed" method="GET" version="1.1">
                    <http_header name="Authorization" value="Bearer %%_token%%"/>
                </http>
            </request>
        </session>
    </sessions>
</tsung>